taskt/Core/Automation/Commands/KeyMouseGroup/EnterShortcutKeyCommand.dot
digraph "EnterShortcutKeyCommand" {
"EnterShortcutKeyCommand" -> "AOneWindowNameActionCommands";
"EnterShortcutKeyCommand" -> "IEnterShortcutKeyProperties";
"AOneWindowNameActionCommands" -> "AOneWindowNameCommands";
"AOneWindowNameActionCommands" -> "IOneWindowNameActionProperties";
"AOneWindowNameCommands" -> "AWindowNameCoreCommands";
"AOneWindowNameCommands" -> "IOneWindowNameProperties";
"AWindowNameCoreCommands" -> "ScriptCommand";
"AWindowNameCoreCommands" -> "IWindowNameCoreProperties";
"ScriptCommand" -> "IUIParameterProperties";
"ScriptCommand" -> "ICommandIDProperties";
}
