taskt/Core/Automation/Commands/KeyMouseGroup/EnterShortcutKeyCommand.puml
@startuml
EnterShortcutKeyCommand --> AOneWindowNameActionCommands
EnterShortcutKeyCommand --> IEnterShortcutKeyProperties
AOneWindowNameActionCommands --> AOneWindowNameCommands
AOneWindowNameActionCommands --> IOneWindowNameActionProperties
AOneWindowNameCommands --> AWindowNameCoreCommands
AOneWindowNameCommands --> IOneWindowNameProperties
AWindowNameCoreCommands --> ScriptCommand
AWindowNameCoreCommands --> IWindowNameCoreProperties
ScriptCommand --> IUIParameterProperties
ScriptCommand --> ICommandIDProperties
@enduml
